## Задача №1:
#
# Джон Макклейн пытается найти этаж на котором заложена бомба и у него есть список инструкций (в файле data/1.txt):
#
# (- Джон должен подняться на этаж выше
# ) - Джон должен опуститься на этаж ниже
#
# Поиск начинается с нулевого этажа. 
#
# На каком этаже находится бомба?
#
## Требования к решению:
# - Входные данные находятся в файле data/1.txt
# - Результат должен быть выведен в консоль командой puts
#
#
## Решение:

arr = Array.new
floor = 0
File.open("data/1.txt", "r") do |file|
    arr = file.readlines
end
str = arr.to_s
str.each_char do |c|
  if c == '('
    floor += 1
  elsif c == ')'
    floor -= 1
  end
end
puts "#{floor}"



